# Exercises 1

In [48]:
import env
import pandas as pd
import os

In [55]:
def get_db_url(db, env_file=os.path.exists('env.py')):
    if env_file:
        username, pword, host = (env.user,env.password,env.host)
        return f'mysql+pymysql://{username}:{pword}@{host}/{db}'
    else:
        print('You need an env.py file in your directory')

In [60]:
url = get_db_url('employees')
query = 'SELECT * FROM employees'

In [61]:
employees = pd.read_sql(query,url)

In [5]:
employees.shape

(300024, 6)

In [6]:
titles = pd.read_sql('SELECT * FROM titles',url)

In [7]:
titles.shape

(443308, 4)

In [8]:
employees.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [9]:
titles.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [10]:
titles.columns

Index(['emp_no', 'title', 'from_date', 'to_date'], dtype='object')

In [11]:
#Unique Titles
len(titles['title'].unique())

7

In [12]:
titles['to_date'].min()

datetime.date(1985, 3, 1)

In [13]:
titles['to_date'].max()

datetime.date(9999, 1, 1)

# Exercises 2

In [14]:
#Copy the users and roles DataFrames from the examples above.
import numpy as np
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})


roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})

In [15]:
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [16]:
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [17]:
#What is the result of using a right join on the DataFrames?
right_merge = users.merge(roles,left_on = 'role_id',right_on='id', how = 'right', indicator = True)
right_merge

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0     1      admin        both
1   2.0    joe      2.0     2     author        both
2   3.0  sally      3.0     3   reviewer        both
3   4.0   adam      3.0     3   reviewer        both
4   NaN    NaN      NaN     4  commenter  right_only

In [18]:
#What is the result of using an outer join on the DataFrames?
outer_merge = users.merge(roles,left_on = 'role_id',right_on='id', how = 'outer', indicator = True)
outer_merge

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0   1.0      admin        both
1   2.0    joe      2.0   2.0     author        both
2   3.0  sally      3.0   3.0   reviewer        both
3   4.0   adam      3.0   3.0   reviewer        both
4   5.0   jane      NaN   NaN        NaN   left_only
5   6.0   mike      NaN   NaN        NaN   left_only
6   NaN    NaN      NaN   4.0  commenter  right_only

In [19]:
#What happens if you drop the foreign keys from the DataFrames and try to merge them?

#You're not going to have a way to merge them.

In [20]:
#Load the mpg dataset from PyDataset.
from pydataset import data
mpg = data('mpg')

In [21]:
#Output and read the documentation for the mpg dataset.
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

In [22]:
#How many rows and columns are in the dataset?
mpg.shape

(234, 11)

In [23]:
#Check out your column names and perform any cleanup you may want on them.
mpg.columns

Index(['manufacturer', 'model', 'displ', 'year', 'cyl', 'trans', 'drv', 'cty',
       'hwy', 'fl', 'class'],
      dtype='object')

In [24]:
#Display the summary statistics for the dataset.
mpg.describe().round(2)

        displ     year     cyl     cty     hwy
count  234.00   234.00  234.00  234.00  234.00
mean     3.47  2003.50    5.89   16.86   23.44
std      1.29     4.51    1.61    4.26    5.95
min      1.60  1999.00    4.00    9.00   12.00
25%      2.40  1999.00    4.00   14.00   18.00
50%      3.30  2003.50    6.00   17.00   24.00
75%      4.60  2008.00    8.00   19.00   27.00
max      7.00  2008.00    8.00   35.00   44.00

In [25]:
#How many different manufacturers are there?
len(mpg.manufacturer.unique())

15

In [26]:
#How many different models are there?
len(mpg.model.unique())

38

In [27]:
#Create a column named mileage_difference like you did in the DataFrames exercises; 
#this column should contain the difference between highway and city mileage for each car.
mpg['mileage_difference'] = mpg.hwy - mpg.cty
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10

In [28]:
#Create a column named average_mileage like you did in the DataFrames exercises; 
#this is the mean of the city and highway mileage.
mpg['average_mileage']=(mpg.cty+mpg.hwy)/2

In [67]:
#Create a new column on the mpg dataset named is_automatic that holds boolean values denoting 
#whether the car has an automatic transmission.
mpg['is_automatic'] = mpg.trans.str.startswith('a')

In [64]:
#Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?
mpg.groupby('manufacturer').average_mileage.agg('mean').sort_values(ascending=False)

manufacturer
honda         28.500000
volkswagen    25.074074
hyundai       22.750000
subaru        22.428571
audi          22.027778
toyota        21.720588
pontiac       21.700000
nissan        21.346154
chevrolet     18.447368
ford          16.680000
mercury       15.625000
jeep          15.562500
dodge         15.540541
lincoln       14.166667
land rover    14.000000
Name: average_mileage, dtype: float64

In [68]:
#Do automatic or manual cars have better miles per gallon?
mpg.groupby('is_automatic').average_mileage.agg('mean')

is_automatic
False    22.227273
True     19.130573
Name: average_mileage, dtype: float64

# Exercise 3

In [32]:
#Use your get_db_url function to help you explore the data from the chipotle database.
url = get_db_url(user,host,password,'chipotle')

chipotle = pd.read_sql('SELECT * FROM orders',url)
chipotle.head()

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98

In [33]:
def clean_item_price(price):
    return float(price.replace('$',''))
    
clean_item_price('$16.98')

16.98

In [34]:
#What is the total price for each order?
chipotle.item_price = chipotle.item_price.map(clean_item_price)
chipotle.groupby('order_id').item_price.sum()

order_id
1       11.56
2       16.98
3       12.67
4       21.00
5       13.70
        ...
1830    23.00
1831    12.90
1832    13.20
1833    23.50
1834    28.75
Name: item_price, Length: 1834, dtype: float64

In [69]:
#What are the most popular 3 items?
chipotle.groupby('item_name').quantity.count().nlargest(3)

item_name
Chicken Bowl           726
Chicken Burrito        553
Chips and Guacamole    479
Name: quantity, dtype: int64

In [70]:
#Which item has produced the most revenue?
chipotle['item_rev'] = chipotle.quantity * chipotle.item_price
chipotle.groupby('item_name').item_rev.sum().nlargest(3)

item_name
Chicken Bowl       8044.63
Chicken Burrito    6387.06
Steak Burrito      4236.13
Name: item_rev, dtype: float64

In [37]:
#Join the employees and titles DataFrames together.
print(employees.columns)
print(titles.columns)

merged = employees.merge(titles, how = 'inner',on = 'emp_no')

Index(['emp_no', 'birth_date', 'first_name', 'last_name', 'gender',
       'hire_date'],
      dtype='object')
Index(['emp_no', 'title', 'from_date', 'to_date'], dtype='object')

In [38]:
merged.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01

In [39]:
#For each title, find the hire date of the employee that was hired most recently with that title.
merged.groupby('title').from_date.max()

title
Assistant Engineer    2000-02-01
Engineer              2002-08-01
Manager               1996-08-30
Senior Engineer       2002-08-01
Senior Staff          2002-08-01
Staff                 2000-02-01
Technique Leader      2000-02-01
Name: from_date, dtype: object

In [40]:
#Write the code necessary to create a cross tabulation of the number of titles by department. 
#(Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to 
# perform the manipulations.)
url = get_db_url(user,host,password,'employees')
departments = pd.read_sql('SELECT * FROM departments',url)
dept_emp = pd.read_sql('SELECT * FROM dept_emp',url)

In [41]:
departments.head()

  dept_no         dept_name
0    d009  Customer Service
1    d005       Development
2    d002           Finance
3    d003   Human Resources
4    d001         Marketing

In [42]:
merged = merged.merge(dept_emp, on = 'emp_no' ).merge(departments, on = 'dept_no')

In [43]:
pd.crosstab(merged.dept_name,merged.title)

title,Assistant Engineer,Engineer,Manager,Senior Engineer,Senior Staff,Staff,Technique Leader
dept_name,,,,,,,
Customer Service,298,2362,4,2027,13925,16150,309
Development,7769,58135,2,49326,1247,1424,7683
Finance,0,0,2,0,12139,13929,0
Human Resources,0,0,2,0,12274,14342,0
Marketing,0,0,2,0,13940,16196,0
Production,6445,49649,4,42205,1270,1478,6557
Quality Management,1831,13852,4,11864,0,0,1795
Research,378,2986,2,2570,11637,13495,393
Sales,0,0,2,0,36191,41808,0